--------------------------------------------------------------------------------
-- 부록 - SQL 분석 도구
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
-- 1. 실행계획 확인
--------------------------------------------------------------------------------
--------------------------------------------------------------------------------
-- PLAN_TABLE 생성
--------------------------------------------------------------------------------
-- plan_table 생성
@?/rdbms/admin/utlxplan.sql

-- sys.plan_table$에 대한 synonym 조회
select owner, synonym_name, table_owner, table_name
from all_synonyms
where synonym_name = 'PLAN_TABLE';

-- plan_table 조회
select owner, table_name
from dba_tables
where table_name like 'PLAN_TABLE%';